<?php

namespace App\Console\Commands;

use App\Models\AccountModel;
use App\Models\EnrollModel;
use App\Models\PlayerModel;
use App\Models\ScheduleModel;
use Illuminate\Console\Command;

class tmp extends Command
{
    /**
     * The name and signature of the console command.
     *
     * @var string
     */
    protected $signature = 'tmp';

    /**
     * Execute the console command.
     *
     * @return mixed
     */
    public function handle()
    {
        try {
            \DB::beginTransaction();

            $this->createData('','','林祉彤','女','台北市','牟志嵩、周峰民','','','臺北市立成德國小','國小四年級',['速度過樁選手菁英-前溜雙足S形','速度過樁選手菁英-前溜交叉形','速度過樁選手菁英-前進單足S形']);
            $this->createData('','','邱宸奕','男','台北市','牟志嵩、周峰民','','','臺北市立胡適國小','國小三年級',['速度過樁選手菁英-前溜雙足S形','速度過樁選手菁英-前溜交叉形','速度過樁選手菁英-前進單足S形']);
            $this->createData('','','黃品言','女','台北市','牟志嵩、周峰民','','','臺北市立健康國小','國小二年級',['速度過樁選手菁英-前溜雙足S形','速度過樁選手菁英-前溜交叉形','速度過樁選手菁英-前進單足S形']);
            $this->createData('','','黃品文','男','台北市','牟志嵩、周峰民','','','臺北市立健康附幼','幼童',['速度過樁選手菁英-前溜雙足S形','速度過樁選手菁英-前溜交叉形','速度過樁選手菁英-前進單足S形']);
            $this->createData('','','曾昭斌','男','台北市','牟志嵩、周峰民','','','臺北市立國語實小','國小一年級',['速度過樁選手菁英-前溜雙足S形','速度過樁選手菁英-前溜交叉形','速度過樁選手菁英-前進單足S形']);
            $this->createData('','','陳之帆','男','台北市','牟志嵩、周峰民','','','南港高中附設國中','國中',['速度過樁選手菁英-前溜雙足S形','速度過樁選手菁英-前溜交叉形','速度過樁選手菁英-前進單足S形']);
            $this->createData('','','邱妤玹','女','台北市','牟志嵩、周峰民','','','臺北市立東新國小','國小二年級',['速度過樁選手菁英-前溜雙足S形','速度過樁選手菁英-前溜交叉形','速度過樁選手菁英-前進單足S形']);
            $this->createData('','','邱妤玹','女','台北市','牟志嵩、周峰民','','','臺北市立東新國小','國小二年級',['速度過樁選手菁英-前溜雙足S形','速度過樁選手菁英-前溜交叉形','速度過樁選手菁英-前進單足S形']);
            $this->createData('','','邱宜萱','女','台北市','牟志嵩、周峰民','','','臺北市立東新國小','國小六年級',['速度過樁選手菁英-前溜雙足S形','速度過樁選手菁英-前溜交叉形','速度過樁選手菁英-前進單足S形']);
            $this->createData('','','殷群富','男','台北市','牟志嵩、周峰民','','','臺北市立東新國小','國小三年級',['速度過樁選手菁英-前溜雙足S形','速度過樁選手菁英-前溜交叉形','速度過樁選手菁英-前進單足S形']);
            $this->createData('','','鄭妤嫻','女','台北市','牟志嵩、周峰民','','','臺北市立東新國小','國小五年級',['速度過樁選手菁英-前溜雙足S形','速度過樁選手菁英-前溜交叉形','速度過樁選手菁英-前進單足S形']);
            $this->createData('','','詹沂釩','男','台中市','林冠宜','','','台中市立惠文國小','國小五年級',['速度過樁選手菁英-前溜雙足S形','速度過樁選手菁英-前進單足S形']);
            $this->createData('','','蔡予婕','女','桃園市','牟志嵩、周峰民','','','桃園市立石門國小','國小二年級',['速度過樁選手菁英-前溜雙足S形','速度過樁選手菁英-前溜交叉形','速度過樁選手菁英-前進單足S形']);
            $this->createData('','','徐嘉欣','女','新竹縣','朱啟維','','','新竹縣立立湖口高中','高中',['速度過樁選手菁英-前溜雙足S形','速度過樁選手菁英-前溜交叉形','速度過樁選手菁英-前進單足S形']);
            $this->createData('','','趙懷謹','女','新北市','朱啟維','','','新北私立南山高中附設國中','高中',['速度過樁選手菁英-前溜雙足S形','速度過樁選手菁英-前溜交叉形','速度過樁選手菁英-前進單足S形']);
            $this->createData('','','謝宜叡','女','台中市','陳乙文','','','台中市立居仁國中','國中',['速度過樁選手菁英-前溜雙足S形','速度過樁選手菁英-前溜交叉形','速度過樁選手菁英-前進單足S形']);
            $this->createData('','','陳昀聖','男','新北市','黃冠儒、魏庸峻、葉一凡','','','新北市立鷺江國中','國中',['速度過樁選手菁英-前溜雙足S形','速度過樁選手菁英-前溜交叉形','速度過樁選手菁英-前進單足S形']);
            $this->createData('','','林裕家','男','新北市','黃冠儒、魏庸峻','','','新北市立成功國小','國小六年級',['速度過樁選手菁英-前溜雙足S形','速度過樁選手菁英-前溜交叉形','速度過樁選手菁英-前進單足S形']);
            $this->createData('','','楊鈞亞','男','台北市','黃冠儒、魏庸峻','','','台北市立仁愛國小','國小六年級',['速度過樁選手菁英-前溜雙足S形','速度過樁選手菁英-前溜交叉形','速度過樁選手菁英-前進單足S形']);
            $this->createData('','','高翔','男','桃園市','王明瀚','','','桃園市立新街國小','國小六年級',['速度過樁選手菁英-前溜雙足S形','速度過樁選手菁英-前溜交叉形','速度過樁選手菁英-前進單足S形']);
            $this->createData('','','鄭歆弘','男','新竹縣','朱啟維','','','新竹縣立義民高中附設國中部','國中',['速度過樁選手菁英-前溜雙足S形','速度過樁選手菁英-前溜交叉形','速度過樁選手菁英-前進單足S形']);
            $this->createData('','','涂舒婷','女','苗栗縣','巫少裘','','','苗栗縣立明仁國中','國中',['速度過樁選手菁英-前溜雙足S形','速度過樁選手菁英-前溜交叉形','速度過樁選手菁英-前進單足S形']);
            $this->createData('','','趙宣儀','女','臺北市','張友倫','','','臺北市立民權國小','國小三年級',['速度過樁選手菁英-前進單足S形','速度過樁選手菁英-前溜交叉形']);
            $this->createData('','','朱怡蒨','女','苗栗市','巫少裘','','','苗栗市立新英國小','國小五年級',['速度過樁選手菁英-前溜雙足S形','速度過樁選手菁英-前溜交叉形','速度過樁選手菁英-前進單足S形']);
            
            
            \DB::commit();
            $this->info('done');
        } catch (\Exception $e) {
            dd($e);
            \DB::rollBack();
        }
    }

    private function createData($playerID,$identityId,$name,$gender,$city,$coach,$leader,$manager,$agency,$group,$items)
    {
        $this->info('.');
        // PlayerModel::firstOrCreate(['id' => $playerID],[
        //     'account_id' => 40,
        //     'identity_id' => $identityId,
        //     'name' => $name,
        //     'gender' => $gender,
        //     'city' => $city,
        //     'coach' => $coach,
        //     'leader' => $leader,
        //     'manager' => $manager,
        //     'agency' => $agency,
        // ]);


        $playerID = PlayerModel::create([
            'account_id' => 40,
            'identity_id' => $identityId,
            'name' => $name,
            'gender' => $gender,
            'city' => $city,
            'coach' => $coach,
            'leader' => $leader,
            'manager' => $manager,
            'agency' => $agency,
        ])->id;

        foreach ($items as $item) {
            EnrollModel::create([
                'group' => $group,
                'gender' => $gender,
                'item' => $item,
                'player_id' => $playerID,
                'player_number' => $playerID,
                'account_id' => 40,
                'game_id' => 1,
            ]);
        }
    }
}
