app/Services/CheckInService.php

    public function update($playerId, $scheduleSn, $checkStatus)
    {
        $enrollInfo = ScheduleModel::where('game_id', config('app.game_id'))->where('scheduleSn', $scheduleSn)->first();
        $query      = EnrollModel::where('game_id', config('app.game_id'))
            ->where('level', $enrollInfo->level)
            ->where('group', $enrollInfo->group)
            ->where('item', $enrollInfo->item)
            ->where('playerSn', $playerId)
            ->update([
                'check'       => $checkStatus,
                'checkInTime' => $checkStatus == '出賽' ? date('Y/m/d H:i:s', time()) : null,
            ]);
---
select * from `schedule` where `game_id` = 5 and `id` = '6268' limit 1
update `enroll` set `check` = '1', `check_in_time` = '2019/04/08 10:00:01', `enroll`.`updated_at` = '2019-04-08 10:00:01' where `game_id` = 5 and `level` = '選手組' and `group` = '幼童' and `item` = '前進雙足S型' and `player_id` = '1313'