app/Models/EnrollModel.php

    public function cleanRankAndIntegral($scheduleId)
    {
        $gameInfo = ScheduleModel::find($scheduleId);

        $enrolls = $this->select('enroll.id')
            ->leftJoin('player', 'player.id', 'enroll.player_id')
            ->where('game_id', config('app.game_id'))
            ->where('level', $gameInfo->level)
            ->where('gender', $gameInfo->gender)
            ->where('group', $gameInfo->group)
            ->where('item', $gameInfo->item)
            ->get()
            ->map(function ($query) {
                return $query->id;
            });

        return $this->whereIn('id', $enrolls)->update(['rank' => null, 'integral' => null,]);
---
select `enroll`.`id` from `enroll` left join `player` on `player`.`id` = `enroll`.`player_id` where `game_id` = 5 and `level` = '初級組' and `gender` = '男' and `group` = '國小二年級' and `item` = '前進雙足S型'
select * from `player` where `player`.`id` in ('') and `gender` = '男'
select `id` from `enroll` where `game_id` = 5 and `level` = '初級組' and `group` = '國小二年級' and `item` = '前進雙足S型'
update `enroll` set `rank` = '', `integral` = '', `enroll`.`updated_at` = '2019-03-29 10:45:55' where `id` in (3018, 3019, 3020, 3021, 3022)

    public function getResults($level, $gender, $group, $item, $rankLimit)
    {
        return $this::whereHas('player', function ($query) use ($gender) {
            $query->where('gender', $gender);
        })
            ->where('game_id', config('app.game_id'))
            ->where('level', $level)
            ->where('group', $group)
            ->where('item', $item)
            ->where('final_result', '<>', '無成績')
            ->where('final_result', '<>', '')
            ->limit($rankLimit)
            ->orderBy(\DB::raw("final_result * 1"))
            ->get();
---
select `id` from `enroll` where `game_id` = 5 and `level` = '初級組' and `group` = '國小二年級' and `item` = '前進雙足S型' and `final_result` <> '無成績' order by final_result * 1 asc limit 6

    public function countGameItemNumberOfPlayer($group, $gender, $item)
    {

        if ($item == '雙人花式繞樁') {
            // 雙人花式繞樁 沒有分性別
            return $this->leftJoin('player', 'player.id', 'enroll.player_id')
                ->where('game_id', config('app.game_id'))
                ->where('group', $group)
                ->where('item','like', '%'.$item.'%')
                ->count();
        } else {
            return $this->leftJoin('player', 'player.id', 'enroll.player_id')
                ->where('game_id', config('app.game_id'))
                ->where('group', $group)
                ->where('gender', $gender)
                ->where('item','like', '%'.$item.'%')
                ->count();
---
select count(*) as aggregate from `enroll` left join `player` on `player`.`id` = `enroll`.`player_id` where `game_id` = 5 and `level` = '初級組' and `group` = '國小六年級' and `gender` = '男' and `item` = '前進雙足S型'

    public function getParticipateTeam()
    {
        return $this->with('account')->where('game_id', config('app.game_id'))
            ->groupBy('enroll.account_id')
            ->get();
---
select * from `account` where `account`.`id` in (0)
select * from `enroll` where `game_id` = 5 group by `enroll`.`account_id`