app/Models/EnrollModel.php

(select
`gender`,
`level`,
`group`,
`item`,
`city`,
count(*) as quantity
from `enroll` left join `player` on `player`.`id` = `enroll`.`player_id` where `game_id` = 5 and `city` = '臺北市' and `level` = '新人組' group by `level`, `group`, `item`, `gender`) union (select
`gender`,
`level`,
`group`,
`item`,
`city`,
count(*) as quantity
from `enroll` left join `player` on `player`.`id` = `enroll`.`player_id` where `game_id` = 5 and `city` <> '臺北市' and `level` = '新人組' group by `level`, `group`, `item`, `gender`) union (select
`gender`,
`level`,
`group`,
`item`,
`city`,
count(*) as quantity
from `enroll` left join `player` on `player`.`id` = `enroll`.`player_id` where `game_id` = 5 group by `level`, `group`, `item`, `gender`) order by `level` asc, `group` asc, `item` asc, `city` desc, `gender` desc
---
    public function getAllDoc()
    {
        return $this->select(\DB::raw('
            enroll.player_number,
            name,
            `level`,
            `group`,
            gender,
            team_name,
            agency,
            city,
            coach,
            leader,
            management,
            fee,
            GROUP_CONCAT(item) AS itemAll
        '))
            ->leftJoin('player', 'player.id', 'enroll.player_id')
            ->leftJoin('account', 'account.id', 'player.account_id')
            ->leftJoin('registry_fee', 'registry_fee.player_id', 'enroll.player_id')
            ->where('enroll.game_id', config('app.game_id'))
            ->where('registry_fee.game_id', config('app.game_id'))
            ->groupBy('enroll.player_number')
            ->get();