app/Models/ScheduleModel.php

select * from `schedule` where `game_id` = 5
---
    public function getSchedules()
    {
        return $this->where('game_id', config('app.game_id'))->get();

select `id` from `schedule` where `game_id` = 5 limit 1
---
    public function getFirstScheduleId()
    {
        return $this->where('game_id', config('app.game_id'))->value('id');