app/Http/Controllers/Admin/CheckInController.php

update `enroll` set `check` = 0, `check_in_time` = '', `enroll`.`updated_at` = '2019-04-08 10:42:16' where `game_id` = 5 and `level` = '選手組' and `group` = '幼童' and `item` = '前進雙足S型'
---
    public function update(Request $request)
    {
        $enrollIds  = $request->enrollIds;
        $checkInIds = $request->checkInIds;

        EnrollModel::whereIn('id', $enrollIds)->update([
            'check'         => 0,
            'check_in_time' => null,
        ]);

        EnrollModel::whereIn('id', $checkInIds)->update([
            'check'         => 1,
            'check_in_time' => date('Y/m/d H:i:s', time()),
        ]);

select * from `schedule` where `game_id` = 5 limit 1
---
    public function getEnrolls($scheduleId)
    {
        if (is_null($scheduleId)) {
            $schedule = ScheduleModel::where('game_id', config('app.game_id'))->first();
        } else {
            $schedule = ScheduleModel::where('id', $scheduleId)->first();