app/Http/Controllers/Admin/CheckInController.php

    public function index($scheduleId = null)
    {
        if (is_null($scheduleId)) {
            $schedule = ScheduleModel::where('game_id', config('app.game_id'))->first();
        } else {
            $schedule = ScheduleModel::where('id', $scheduleId)->first();
        }

        $enrolls = EnrollModel::wherehas('player', function ($query) use ($schedule) {
            $query->where('gender', $schedule->gender);
        })
            ->where('game_id', config('app.game_id'))
            ->where('level', $schedule->level)
            ->where('group', $schedule->group)
            ->where('item', $schedule->item)
            ->orderBy('appearance')
            ->get();

        $schedules = app(ScheduleModel::class)->getSchedules();

        if (is_null($scheduleId)) {
            $scheduleId = app(ScheduleModel::class)->getFirstScheduleId();
        }

        return view('admin/checkIn')->with(compact('enrolls', 'schedules', 'scheduleId'));
---
select * from `schedule` where `game_id` = 5 and `id` = '6268' limit 1