app/Http/Controllers/Admin/DocController.php

    public function teams()
    {
        $teams = EnrollModel::where('game_id', config('app.game_id'))
            ->groupBy('account_id')
            ->get();

        foreach ($teams as $team) {
            $team->players = EnrollModel::where('game_id', config('app.game_id'))
                ->where('account_id', $team->account_id)
                ->groupBy('player_id')
                ->orderBy('appearance')
                ->orderBy('player_number')
                ->orderBy('player_id')
                ->get();
---
select * from `enroll` where `game_id` = 5 and `enroll`.`account_id` = 0 group by `enroll`.`player_id`