app/Http/Controllers/Admin/GroupingController.php

    public function grouping()
    {
        ScheduleModel::where('game_id', config('app.game_id'))->delete();
---
delete from `schedule` where `game_id` = 5