app/Http/Controllers/Admin/RankController.php

update `enroll` set `rank` = 1, `enroll`.`updated_at` = '2019-03-29 10:45:55' where `id` = 3019
---
    public function processRank($level, $gender, $group, $item, $rankLimit)
    {
        $results = app(EnrollModel::class)->getResults($level, $gender, $group, $item, $rankLimit);

        foreach ($results as $key => $result) {
            if ($key <> 0) {
                if ($results[$key - 1]->final_result == $results[$key]->final_result) { //同成績處理 start
                    $前一個選手的名次 = EnrollModel::where('id', $results[$key - 1]->id)->first()->rank; // todo 這裡的命名要改
                    EnrollModel::where('id', $result->id)->update(['rank' => $前一個選手的名次]);

select `enroll`.`id`, `final_result` from `enroll` left join `player` on `player`.`id` = `enroll`.`player_id` where `game_id` = 5 and `level` = '初級組' and `gender` = '男' and `group` = '國小二年級' and `item` = '前進雙足S型' and `rank` is not null order by final_result * 1 asc limit 6
update `enroll` set `integral` = 1, `enroll`.`updated_at` = '2019-03-29 10:45:55' where `id` = 3019
---
    public function processIntegral($level, $gender, $group, $item)
    {
        $enrolls = EnrollModel::select('enroll.id', 'final_result')
            ->leftJoin('player', 'player.id', 'enroll.player_id')
            ->where('game_id', config('app.game_id'))
            ->where('level', $level)
            ->where('gender', $gender)
            ->where('group', $group)
            ->where('item', $item)
            ->where('check', 1)
            ->limit(6)
            ->orderBy(\DB::raw('final_result * 1'))
            ->get();


        $integrals = $this->getIntegrals($level);

        $count = count($enrolls) - 1;
        foreach ($enrolls as $enroll) {
            $integral = $integrals[$count];

            if ($enroll->final_result == '無成績') {
                continue;
            }

            if ($item == '前進單足S型') {
                $integral++;
            }

            EnrollModel::where('id', $enroll->id)->update(['integral' => $integral]);