app/Http/Controllers/Admin/ResultController.php

                        'score_5' => $skill_5[$key] + $art_5[$key] - $punish[$key],
                    ];

                    EnrollModel::where('id', $enrollId)->update($score);
---
update `enroll` set `round_one_second` = '15.655', `round_one_miss_conr` = '4', `round_two_second` = '7.630', `round_two_miss_conr` = 99, `final_result` = 16.455, `integral` = '', `rank` = '', `enroll`.`updated_at` = '2019-03-29 05:35:20' where `id` = '3018'